{
	"stage_description": "In the previous stage, we identified the background, signal and transitional regions of the ablation data. In this stage, LAtools will use that information to <ol> <li>Calculate the background noise underlying the signal regions</li> <li>Remove the underlying background noise, plus the laser off and transition regions.</li></ol> </b><br> There are two background methods that can be applied: 1D interpolation or weighted mean. Once the background has been calculated, you can view it by clicking <i>Plot in popup</i>.<br> <br> <b>Background calculation using 1D interpolation</b><br> This method fits a polynomial function to all background regions and calculates the intervening background values using a 1D interpolation.<br> <br> <b>Parameters</b> <ul> <li><i>Polynomial Order</i>: the order of polynomial used to fit the background. If zero, flat lines will be interpolated between the background regions.</li> <li><i>Minimum Points</i>: the minimum number of points a background region must have to be included in calculation.</li> <li><i>Maximum Points</i>: The maximum number of points a background region must have to be included in calculation.</li> <li><i>Calculation Steps</i>: the time steps between background calculation points. If blank, this is determined automatically based on your background calculation choices.</li> <li><i>Remove Anomalies</i>: applies a filter to the isolated background regions to exclude regions with anomalously high values.</li> </ul> <b>Background calculation using a weighted mean</b><br> This method calculates a Gaussian-weighted moving average, such that the interpolated background at any given point is determined by adjacent background counts on either side of it, with the closer (in time) being proportionally more important. The full-width-at-half-maximum (Gaussian FWHM) of the Gaussian weights must be specified and should be greater than the time interval between background measurements, and less than the time-scale of background drift expected on your instrument.<br><br> <b>Parameters</b> <ul> <li><i>Gaussian FWHM</i>: the width of the Gaussian used for the weighted average (in seconds)</li> <li><i>Minimum Points</i>: the minimum number of points a background region must have to be included in calculation.</li> <li><i>Maximum Points</i>: The maximum number of points a background region must have to be included in calculation.</li> <li><i>Calculation Steps</i>: the time steps between background calculation points. If blank, this is determined automatically based on your background calculation choices.</li> <li><i>Remove Anomalies</i>: applies a filter to the isolated background regions to exclude regions with anomalously high values.</li> </ul> <b>Background subtraction</b><br> Now that the background has been calculated, we can subtract it. To do this, click <i>Subtract background</i>. ",

	"bkg_method_label": "Background Correction Method",
	"bkg_method_1_label": "Weighted Mean",
	"bkg_method_2_label": "1D Interpolation",

	"weight_fwhm_label": "Gaussian FWHM",
	"weight_fwhm_description": "<qt/>The full-width-at-half-max of the gaussian used to calculate the weighted average.",

	"n_min_label": "Minimum Points",
	"n_min_description": "<qt/>The minimum number of points a background region must have to be included in calculation.",

	"n_max_label": "Maximum Points",
	"n_max_description": "<qt/>The maximum number of points a background region must have to be included in calculation.",

	"kind_label": "Polynomial Order",
	"kind_description": "<qt/>The order of polynomial used to fit the background. If zero, flat lines will be interpolated between the background regions.",

	"cstep_label": "Calculation Steps",
	"cstep_description": "<qt/>The interval between calculated background points.",

	"bkg_filter_label": "Remove Anomalies",
	"bkg_filter_description": "<qt/>Applies a rolling filter to the isolated background regions to exclude regions with anomalously high values.",

	"f_win_label": "f_win",
	"f_win_description": "<qt/>The size of the rolling window.",

	"f_n_lim_label": "f_n_lim",
	"f_n_lim_description": "<qt/>The number of standard deviations above the rolling mean to set the threshold.",

	"subtract_button_description": "<qt/>To continue on you must first Calculate background, then Subtract background."
}