{
	"filter_name": "Clustering",
	"filter_description": "Applies an n - dimensional clustering filter to the data.<br><br><strong>Clustering Algorithms</strong><ul><li>’meanshift’: The sklearn.cluster.MeanShift algorithm. Automatically determines number of clusters in data based on the bandwidth of expected variation.</li><li>’kmeans’: The sklearn.cluster.KMeans algorithm. Determines the characteristics of a known number of clusters within the data. Must provide n_clusters to specify the expected number of clusters.</li><li>’DBSCAN’: The sklearn.cluster.DBSCAN algorithm. Automatically determines the number and characteristics of clusters within the data based on the ‘connectivity’ of the data (i.e. how far apart each data point is in a multi - dimensional parameter space). Requires you to set eps, the minimum distance point must be from another point to be considered in the same cluster, and min_samples, the minimum number of points that must be within the minimum distance for it to be considered a cluster. It may also be run in automatic mode by specifying n_clusters alongside min_samples, where eps is decreased until the desired number of clusters is obtained.</li></ul>",
	"analyte_label": "Analytes",
	"analyte_description": "<qt/>Which analytes to consider.",
	"filt_label": "To filtered",
	"filt_description": "<qt/>Whether or not to apply existing filters to the data before calculating this filter.",
	"method_label": "Method",
	"method_description": "<qt/>Which clustering algorithm to use.",
	"normalise_label": "Normalise",
	"normalise_description": "<qt/>Whether or not to normalise the data to zero mean and unit variance. Reccomended if clustering based on more than 1 analyte. Uses sklearn.preprocessing.scale.",
	"time_label": "Include time",
	"time_description": "<qt/>Whether or not to include the Time variable in the clustering analysis. Useful if you’re looking for spatially continuous clusters in your data, i.e. this will identify each spot in your analysis as an individual cluster.",
	"sort_label": "Sort",
	"sort_description": "<qt/>Whether or not you want the cluster labels to be sorted by the mean magnitude of the signals they are based on (0 = lowest)",
	"min_label": "Minimum points",
	"min_description": "<qt/>The minimum number of data points that should be considered by the filter. Default = 10.",
	"n_clusters_label": "Clusters",
	"n_clusters_description": "<qt/>The number of clusters to be created. Only applies to the kmeans method." 
}