{
	"filter_name": "Clustering",
	"filter_description": "The clustering filter uses data clustering algorithms to identify compositionally distinct populations in your data, based on the concentrations of one or more analytes. These filters can be applied at the &#39;whole analysis&#39; or &#39;individual ablation&#39; levels. Two difference clustering algorithms are available:<ul><li><b>kmeans</b> - separates the data into N clusters, such that the variance within each cluster is minimised. Useful for automatically separating separate materials in data, where the number of separate materials is known.</li><li><b>meanshift</b> - automatically determines number of clusters in data based on the bandwidth of expected variation. This one can be useful when the number of materials in the data is not known, although can become difficult to interpret in complex datasets. For most purposes, kmeans will probably be better.</li></ul>",
	"analyte_label": "Analytes",
	"analyte_description": "<qt/>The analyte(s) that the filter is created from.",
	"filt_label": "To filtered",
	"filt_description": "<qt/>Whether or not to apply existing filters to the data before calculating this filter.",
	"method_label": "Method",
	"method_description": "<qt/>Which clustering algorithm to use.",
	"normalise_label": "Normalise",
	"normalise_description": "<qt/>Whether or not to normalise the before identifying clusters. Must be checked if clustering based on more than 1 analyte.",
	"time_label": "Include time",
	"time_description": "<qt/>Whether or not to include the Time variable in the clustering analysis. Useful if you&#39;re looking for spatially continuous clusters in your data, i.e. this will identify each spot in your analysis as an individual cluster.",
	"sort_label": "Sort",
	"sort_description": "<qt/>Whether or not you want the identified clusters to be sorted by the mean magnitude of the signals they are based on.",
	"min_label": "Minimum points",
	"min_description": "<qt/>The minimum number of data points that should be considered by the filter. Default = 10.",
	"n_clusters_label": "Clusters",
	"n_clusters_description": "<qt/>The number of clusters to be created. Only applies to the kmeans method." 
}