{
	"stage_description": "Despiking remotes all physically unrealistic outliers from your data. You may skip this step if you believe your data contains no anomalous values.<br> <br> There are two despiking methods: <i>exponential decay despike</i> and <i>noise despike</i>. Both methods have several parameters that change their behaviour. To use a despiker, tick the method/s you wish to apply, change any parameters if required, then click <i>APPLY</i>. If both despike methods are ticked, exponential decay despike will be applied first, followed by noise despike.<br> <br> <b>Exponential decay despiker</b><br> The exponential decay despike method removes all low outliers in your data by using the signal washout time of your laser ablation cell. The signal washout is described using an exponential decay function. If the measured signal decreases faster than physically possible based on your laser setup, these points are removed, and replaced with the average of the adjacent values.<br> <br> <b>Parameters</b> <ul> <li><i>Washout Exponent</i>: if you know the exponential decay constant that describes the washout characteristics of your laser ablation cell, you can enter this value in the <i>Washout Exponent</i> input box. This value must be a real number. If you do not know this value, leave it blank and LAtools will calculate it for you. The value calculated will be displayed after you click <i>APPLY</i>. </li> </ul><br> <b>Noise despiker</b><br> This noise despike method removes high outliers by applying a moving standard-deviation filter. Outliers are replaced with the mean of the adjacent data points.<br> <br> <b>Parameters</b> <ul> <li><i>Smoothing Window</i>: this value is the width (number of data points) used to calculate the running mean and standard deviation of the data. This value defaults to 3. This value must be a positive integer.</li> <li><i>N-Standard Deviation</i>: this value is the number of standard deviations above the rolling mean that data are excluded. This value defaults to 12. This value must be a real number.</li> <li><i>Maximum Cycles</i>: this value is the maximum number of times the filter is applied. If there is no more data to remove before the maximum is reached, the filter will stop. This value defaults to 4. This value must be an integer.</li> </ul><br> ",
	
	"despike_1": "Exponential decay despiker",
	
	"exp_decay_label": "Cell Washout Despiking",
	"exp_decay_description": "<qt/>Remove physically impossible data based on the washout characteristics of your ablation cell.",
	
	"exponent_label": "Washout Exponent",
	"exponent_description": "<qt/>The exponential decay coefficient that describes your ablation cell washout speed. If blank, this is calculated automatically from SRM washouts.",

	"despike_2": "Noise despiker",

	"noise_label": "Signal Smoothing",
	"noise_description": "<qt/>Apply a moving standard-deviation filter to your data to remove outliers.",

	"win_label": "Smoothing Window",
	"win_description": "<qt/>The width of the window (number of data points) used to calculate the running mean and standard deviation of the data.",

	"nlim_label": "N-Standard Deviations",
	"nlim_description": "<qt/>Data greater than N*the standard deviation from the mean will be removed. This number should be large enough to only remove outliers, to avoid over-smoothing your data.",

	"maxiter_label": "Maximum Cycles",
	"maxiter_description": "<qt/>The filter will be re-applied until no more data are removed, or it has been applied this many times."
}