{
	"stage_description": "In this stage you will be importing and configuring all the data required for your analysis session.<br> <br> <b>1. Loading your data</b><br> To load your data, you will need to tell LAtools where your ablation sample files and standard reference material (SRM) files are saved. These files should all be in the same folder. Please note that the names of your files will be used to label the data throughout the analysis, so make sure they are meaningful and unique.<br> <br> Each ablation file should contain ablation data from a single sample. If your entire analytical session is in a single data file, you will need to split the data up into separate files.<br> <br> To upload your files, click on <i>Browse</i> and navigate to the folder containing the files. Then click <i>open</i>.<br> <br> <b>2. Configuration</b><br> A configuration stores information about the way your data is formatted, and where on your computer your SRM tables are saved. If you have not configured your data, see the <a href=&#34;https://latools.readthedocs.io/en/latest/users/configuration/howto.html&#34;>configuration guide</a> to set one up. Otherwise, select your configuration from the <i>Configuration</i> drop down menu. <br><br> <b>3. Standard Reference Material (SRM) File Identifier</b><br> The file names of your SRM files should contain an identifying set of characters. These characters help LAtools identify them. By default, LAtools will looks for &#34;STD&#34;, but if you are using another set of characters enter them into the <i>SRM File Identifier</i> input field. Make sure all of your SRM file names contain this set of characters before you upload them.<br> <br> <b>4. Data File Extension</b><br> This is used to identify the ablation sample files and SRM files in the directory specified in Step 1. All the files in the directory with this extension will be imported. By default, LAtools will look for .csv files. If you wish to use another file type enter the extension into the <i>Data File Extension</i> input field.<br> <br> <b>5. Graphing the raw data</b><br> Upload and graph your ablation and SRM data by clicking <i>APPLY</i>.<br> ",

	"find_data_label": "Browse",
	"find_data_description": "<qt/>File path to the directory containing the data files.",
	
	"config_label": "Configuration",
	"config_description": "<qt/>The name of the LAtools configuration you want to use to import the data.",

	"srm_label": "SRM File Identifier",
	"srm_description": "<qt/>This is used to identify SRM measurements in your data file, and should be present in the file names of all analyses containing SRMs.",

	"file_extension_label": "Data File Extension",
	"file_extension_description": "<qt/>This is used to identify data files in the analysis directory. All files in the directory with this extension will be imported.",

	"general_error_label": "Error loading data files",
	"general_error_description": "An error occurred while attempting to load the data files. \n Please check that the specified data folder contains the correct data files"
}